class NotificationMessageModel {
  String title;
  String body;
  NotificationMessageModel({
    required this.title,
    required this.body,
  });
}

final List<List<String>> dummyRepeatedNotificationList = [
  [
    '🍲 فيه عزومة؟',
    ' عندنا كل اللي محتاجاه علشان تعملي أحلى سفرة من غير طلعة واحدة 🛒✨',
  ],
  [
    '🛍️ شوفتي العروض النهارده؟',
    'خصومات مجنونة على منتجاتك المفضلة 👀 سريعي قبل ما تخلص 🕒',
  ],
  [
    '🧼 عايزة تنضفي بيتك بسهولة؟',
    ' أدوات تنظيف، معطرات، ومنتجات مميزة توصلك لحد باب البيت 🧽🚪',
  ],
  [
    '🥦 خضارك فريش وجاهز!',
    'اطلب دلوقتي خضار فريش يتغسل ويتقطع ويوصلك وانتِ في بيتك 🥬📦',
  ],
  [
    '👗 لسه مستنية إيه؟',
    ' فاشون، بيوتي، وإكسسوارات بأسعار ولا في الأحلام! 💅💃',
  ],
  [
    '🔥 عرض اليوم بس!',
    'خصم %50 على منتجات مختارة. اضغطي وشوفي إيه اللي مستنيكي 🎉🛍️',
  ],
  [
    '🍋 نظافة وانتعاش؟',
    'منظفات، معطرات، وكل اللي بيتك محتاجه بتوصيل سريع 🚚✨',
  ],
  [
    '🍅 طبختك جاهزة!',
    'اطلبي خضارك متقطع ومغسول ووفرنا عليكي الوقت 💚🥬',
  ],
  [
    '💅 وقت الدلع؟',
    'طلبي مستحضرات التجميل اللي بتحبيها بأسعار تنافسية 💖',
  ],
  [
    '🎉 شكراً لولائك!',
    'عندك خصم حصري على طلبك الجاي! استخدمي الكود: WELCOME10 🎁',
  ],
  [
    '⌛ لسه بتفكري؟',
    'المنتج اللي شفتيه من شوية قرب يخلص من المخزون! 🛒😱',
  ],
];
